[{
  "_id": {
    "$oid": "63c168b99cfbe126757eb169"
  },
  "Name": "Anemone, Giant",
  "Climate/Terrain": "Tropical, subtropical, and temperate/Salt water",
  "Frequency": "Very rare",
  "Organization": "School",
  "Activity Cycle": "Any",
  "Diet": "Carnivore",
  "Intelligence": "Animal (1)",
  "Treasure": "See below",
  "Alignment": "Neutral",
  "Armor Class": "2",
  "Movement": "4",
  "Hit dice": "16",
  "THAC0": "5",
  "Damage/Attack": "See below",
  "Special Attacks": "See below",
  "Special Defenses": "See below",
  "Magic Resistance": "Nil",
  "Size": "L (10° diameter trunk)",
  "Morale": "Steady (11)",
  "XP Value": "12,000",
  "Psionic Summary": "",
  "Description": "<div>The anemone is a mobile, plant-like creature A voracious carnivore, it is a threat to all denizens of the sea.</div><div class='indent'>The anemone has a thick, cylindrical trunk that is ten feet in diameter and about eight feet tall.The trunk is usually bright purple, but can also be blue red, pink, or any combination of these colors The bottom of the trunk is covered with small suckers, while the top contains a toothless mouth surrounded by ten translucent tentacles, each 10-15 feet in length.</div><br/><div><b1>Combat:</b1> The anemone attacks with whip-like lashes of its tentacles it makes 1d3 attacks per round, each attack consists of 1dl0 tentacle strikes. A victim struck by a tentacle suffers 1d4 points of damage and also must roll a saving throw vs. paralysis A victim succeeding on the saving roll is immune to all paralyzing and poison effects of that particular anemone. If the saving throw is unsuccessful, the victim suffers an additional 1d6 points of poison damage and becomes paralyzed for the next 3d6 rounds. During this time, the victim is unable to attack or take any other actions Should the effects of the paralysis wear off, the anemone will attack him again; if it hits the victim can again attempt a saving throw to avoid the poison and the paralysis.</div><div class='indent'>The anemone uses its tentacles to drag a paralyzed victim to its mouth, a process that takes one round to complete. it requires at least two tentacles to drag a victim; the anemone can use any free tentacles to continue attacks on other opponents The mouth leads directly to the anemone's trunk cavity. When a victim is inside the cavity, the mouth seals shut. Tiny valves at the base of the trunk expel all of the water within the cavitv (this takes eight rounds). When the cavity is empty, it begins to refill with acidic juices secreted from glands in the base. The cavity fills with acidic juices at the rate of one foot per turn until the entire cavity is filled. Beginning on the first round of secretion, victims trapped in the cavity suffer 1d4 points of damage (no saving throw). Digestion is completed when the victim is reduced to -12 or fewer hit points, after which resurrection is impossible.</div><div class='indent'>Because of the confined space, victims trapped in the cavity can use only short, sharp weapons to hack themselves tree. Maximum normal damage is 1 point per round plus magical and Strength bonuses. Rescue must usually come from outside. If the anemone suffers a loss of 50% of its hit points, and all of the dam age is directed at its trunk the victim can be freed. Thrusting and stabbing weapons have a 20% chance of striking the victim trapped in the trunk. If a trapped character is freed, charactcrs on the outside have a chance of suffering damage from the acidic juice, assuming they are within ten feet of the anemone. The percentage chance of receiving damage is equal to 5% for each foot of juice in the anemone when the victim inside is freed. Characters affected by the juice suffer 1d4 points of damage. (For instance, if the cavity was filled with four feet of acidic juice when the victim inside was freed, all characters within ten feet of the anemone have a 20% chance of suffering 1d4 points of damage from the juice.)</div><div class='indent'>Each tentacle can suffer only 5 points of damage before it is Severed, assuming that the attacker is directing his attacks to the same area in order to chop it off. An anemone regenerates at the rate of 1 point per turn, and it always repairs its tentacles first. If the anemone suffers 30 or more points of damage in a single round, it withdraws all of its tentacles inside its body for 1d10 rounds and spews acidic juices in a ten-foot radius. Those within ten feet of the anemone when it spews juice have a 90% chance of suffering 1d4 points of damage; this check must be made for each round the character is exposed to the acid. When the anemone releases its tentacles, it stops spewing (for instance, if the anemone withdraws its tentacles for six rounds, it also spews juice for six rounds).</div><br/><div><b1>Habitat/Society:</b1> Anemones wander the ocean floor. They move slowly and with great effort, generally preferring to remain stationary for long periods by attaching to a rock or other solid surface. They usually travel in schools of three or more.</div><div class='indent'>Anemones are asexual, reproducing via buds which break off and grow into new anemones. Indigestible treasure items can sometimes be found beneath their trunks.</div><br/><div><b1>Ecology:</b1> Anemones eat all species of marine life. Anemones relish humanoids, especially elves and small humans. Although most sea creatures give anemones wide berth, manta rays and small sucker fish are sometimes seen swimming among a school of anemones, as these creatures are immune to the effects of their tentacles.</div>",
  "Source": "TSR2105",
  "Image": ""
}]